{

  "title": "Terms, Disclaimers & Legal Clauses",
  "sections": [
    {
      "title": "Licensing & Compliance",
      "text": "Contractor confirms it holds a valid Ontario Electrical Safety Authority (ESA) contractor licence. All work will be performed by licensed personnel in compliance with the Ontario Electrical Code and ESA regulations."
    },
    {
      "title": "Material Price Disclaimer & Follow‑Up Quotation",
      "text": "Material pricing is based on current supplier costs and selected budget‑level materials as of the date above. If the Client selects upgraded materials (e.g. premium pot lights) or supplier pricing increases prior to procurement, a revised quote will be issued, which must be approved in writing before ordering or installation proceeds. Final invoice will reflect actual materials supplied and invoiced."
    },
    {
      "title": "Estimate Validity Period",
      "text": "This estimate remains valid for 30 calendar days from the issue date. Contractor may withdraw or revise pricing if work has not commenced within this time."
    },
    {
      "title": "Notification of Material Price Changes",
      "text": "Contractor will promptly notify the Client in writing of any supplier cost increases or material specification changes that materially affect pricing. A revised quote must be signed before proceeding."
    },
    {
      "title": "Client Option on Material Selection",
      "text": "Client may elect to proceed with the materials and brands listed in the estimate to avoid delay. If material changes are requested later, revised pricing and written Client approval will be required."
    },
    {
      "title": "Scope Changes & Additional Work",
      "text": "Any modifications—including increased quantities, upgraded materials, additional circuits, or hidden site conditions—not covered by this estimate will require a written change order and may impact cost and schedule."
    },
    {
      "title": "Pricing Adjustment Clause",
      "text": "If material costs increase significantly (e.g. due to inflation, tariffs, or supplier surcharges) by more than 5%, Contractor reserves the right to adjust pricing proportionately. Any adjustment will be communicated in writing and requires Client approval before proceeding with ordering."
    },
    {
      "title": "Payment Terms",
      "text": "A 50% deposit is due prior to work commencement; remaining balance is due on completion. Accepted payment methods: e‑transfer, cheque, or methods approved by Contractor. Outstanding amounts beyond 7 days from invoice may incur a 1.5% monthly late fee."
    },
    {
      "title": "Contingency & Site Assumptions",
      "text": "The estimate assumes conditions visible during inspection. Concealed infrastructure or obstacles may lead to additional charges. Refer to the exclusions list."
    },
    {
      "title": "Indemnification & Insurance",
      "text": "Client and Contractor agree to indemnify and hold harmless the other from claims arising from negligence or breach, except for gross negligence or willful misconduct. Contractor maintains liability insurance and can provide proof upon request."
    },
    {
      "title": "Limitation of Liability",
      "text": "Contractor is not liable for delays, defects, or damage caused by pre‑existing conditions, force majeure, or third parties. Damage due to Client‑supplied materials, site conditions, or delays is excluded."
    },
    {
      "title": "Confidentiality",
      "text": "Both parties agree to keep the terms of this Agreement and related documents confidential and not disclose them to third parties without consent."
    },
    {
      "title": "Assignment & Delegation",
      "text": "Neither party may assign or delegate their rights or obligations except by prior written consent. Contractor may subcontract portions of the work but remains responsible for performance quality."
    },
    {
      "title": "Cancellations & Rescheduling",
      "text": "Cancellation less than 48 hours before the scheduled start forfeits deposit. Rescheduling must be requested at least 48 hours in advance."
    },
    {
      "title": "Exclusivity & Commitment",
      "text": "By signing and paying the deposit, the Client agrees not to engage other providers for the same work unless this Agreement is formally canceled in writing."
    },
    {
      "title": "Term & Termination",
      "text": "This Agreement remains in force until work is complete or terminated in writing. Early termination by Client requires written notice; Contractor may retain deposit and compensation for work performed."
    },
    {
      "title": "Dispute Resolution & Governing Law",
      "text": "Disputes will first be addressed through informal negotiations. If unresolved, parties agree to mediation or arbitration in Ontario under Ontario law."
    }
  ]
}
